let arr = [
  {
    year: -781,
    country:
      [
        {
          id: 3, incident: '周宣王之子幽王即位', info: `周幽王为了博取冷若冰霜的“冷美人”褒姒灿若桃李一笑，听信佞臣虢石父之言，在骊山上演了一出“烽火戏诸侯”的闹剧，
骊山上接二连三上演的“焰火晚会”，让各路诸侯心存不满。但为了进一步讨好褒姒，周幽王罔顾老祖宗的规矩和王室的反对，废黜王后申氏和太子宜臼，册封褒姒为后，立褒姒生的儿子伯服为太子，并下令废去老丈人申侯的爵位，还准备出兵攻伐他，
申侯得到这个消息，决定先发制人。` },
      ]
  },
  {
    year: -771,
    country:
      [
        {
          id: 3, incident: `申侯联合缯国、犬戎、西夷共同起兵。幽王以烽火报警，
而各地救兵不至。犬戎攻克镐京，斩杀幽王，灭亡西周`, info: `申侯联合缯侯及西北夷族犬戎之兵，进攻镐京。周幽王听到犬戎进攻的消息，惊慌失措，急忙命令烽火台点燃烽火。烽火倒是点起来了，可惜诸侯们因前几次受了愚弄，这次都不再理会。在内乱外患的双重打击下，醉生梦死的周幽王带领褒姒、伯服等人携王室珍宝逃往骊山，最终落得个身首异处、命丧黄泉的悲惨下场。`
        },
      ]
  },
  {
    year: -770,
    country:
      [
        { id: 4, incident: '原太子宜臼在申侯的拥戴下即天子位，延续周祀，是为周平王\n周平王在秦襄公、晋文侯、郑武公、卫武公的带兵护送下东迁洛邑时，周幽王的弟弟余臣在虢公的支持下也称王，即周携王' },
      ]
  },
  {
    year: -510,
    country:
      [
        { id: 14, incident: '越国允常执政，吴国阖闾大举侵犯越国', info: '原因是：吴王指责越王允常身为盟友“不听话”，没有跟自己一块参与打楚国' },

      ]
  },
  {
    year: -505,
    country:
      [
        { id: 15, incident: '越王允常决定举兵反击', info: '允常趁当时吴军正在与楚交战期间，挥师偷袭，兴兵伐吴，对五年前吴军进犯展开了军事报复。然而，由于吴国军事力量正处于鼎盛时期，越军并未取得重大战果' },
      ]
  },
  {
    year: -497,
    country:
      [
        { id: 15, incident: '越王允常去世，勾践继位 ' },
      ]
  },
  {
    year: -496,
    country:
      [
        {
          id: 14, incident: '吴国阖闾亲自率领吴国大军攻越，吴王阖闾阵亡，吴王夫差继位 ', info: `勾践让人把越国大牢中的死囚犯组织集中起来，以临时组建一支敢死队，勾践现场展开了一场堪称深刻的思想动员。\n当吴、越双方在檇李摆开战场后，勾践先派出两支队伍发起攻势。然而，吴军阵势严整，不动如山，导致越国的这两次猛攻都劳而无功，反而损失惨重。\n正当阖闾和吴国众将看着先前不堪一击四处逃散的越军哈哈大笑，放松警惕的时候，突然见到越国军阵中走出了三排赤身露体、披发赤足的人来。每排皆有百余人，每个人一手拎着自己的散发，一手以剑按颈，嘴里高喊着口号，步履整齐地向吴军阵营大踏步走过来。只听得越军前排有人高喊：“吴、越两国君王在此兵戎相见，我等在行动中动作不敏，触犯军令，不敢逃避刑罚，羞于苟活，愿意在阵前自杀谢罪。”话一说完，脖子一抹，鲜血四溅，齐刷刷的，倒地而亡。\n吴军上下傻眼了，这是演的哪出戏呀？怎么两军交战，还没拼出个你死我活，倒自己把自己给抹了脖子？前面的军士看傻了，还没回过神来，而后面的将士听说出怪事了，也顾不上这是在打仗了，纷纷争着挤着要凑上前去看热闹，挡都挡不住。这身形一移动，吴军先前严密齐整的队形开始乱了。
先前的惨烈血腥还没有让吴国军士们反应过来，第二队不要命的人又大踏步上来了。依然是那几句话，一喊完，一抹脖子，刎颈而死。随后，第三排也同样大踏步上来，依样画葫芦，又抹了自己的脖子。在吴国军士的眼里，如果越国第一队敢死队的行为让他们惊呆和不解的话，第二队和第三队的相继上阵已让他们心生恐惧了。\n这是怎样的一支队伍呀，见过不要命的，没见过如此不要命的，还给不给我们战斗的机会了？这还算是正常的人吗？近距离注目观看的吴军将士，顿时惊骇不已，军心大乱，所有人的大脑在那一个时刻被深深震撼，短时间内根本反应不过来。勾践不失时机，突然指挥进攻，一举大败吴军，使溃不成军的吴军死伤无数。\n在战争中，越大夫灵姑浮“以戈击阖闾，阖闾伤将指”，不但斩落他的脚趾，还捡到了他的一只鞋。身受重伤的阖闾血流如注，也许是受了破伤风感染，也许是始终过不去心头那道坎，一生征战无数却在退到七里后的陉地时，终于阵亡于军中。`},
      ]
  },
]
let wrap = document.querySelector('tbody');
let str = '';
for (let i = 0; i < arr.length; i++) {
  str += `<tr><th class="thFiexd" scope="row">${arr[i].year < 1 ? '前' + Math.abs(arr[i].year) : arr[i].year}</th>`
  for (let j = 0; j < arr[i].country.length; j++) {
    if (j > 0) {
      let num = arr[i].country[j].id - arr[i].country[j - 1].id;
      for (let n = 1; n < num; n++) {
        str += `<td></td>`
      }
    } else {
      for (let n = 1; n < arr[i].country[j].id; n++) {
        str += `<td></td>`
      }
    }
    str += `<td>${arr[i].country[j].incident}`
    if (arr[i].country[j].info) {
      str += `<div><i>详情</i><div>${arr[i].country[j].info}<div></div>`
    }
    str += `</td>`
  }
  str += `</tr>`
}
wrap.innerHTML = str