let arr = [
  {
    year: -781,
    country:
      [
        {
          id: 3, incident: '周宣王之子幽王即位', info: `周幽王为了博取冷若冰霜的“冷美人”褒姒灿若桃李一笑，听信佞臣虢石父之言，在骊山上演了一出“烽火戏诸侯”的闹剧，
骊山上接二连三上演的“焰火晚会”，让各路诸侯心存不满。但为了进一步讨好褒姒，周幽王罔顾老祖宗的规矩和王室的反对，废黜王后申氏和太子宜臼，册封褒姒为后，立褒姒生的儿子伯服为太子，并下令废去老丈人申侯的爵位，还准备出兵攻伐他，
申侯得到这个消息，决定先发制人。` },
      ]
  },
  {
    year: -771,
    country:
      [
        {
          id: 3, incident: `申侯联合缯国、犬戎、西夷共同起兵。幽王以烽火报警，
而各地救兵不至。犬戎攻克镐京，斩杀幽王，灭亡西周`, info: `申侯联合缯侯及西北夷族犬戎之兵，进攻镐京。周幽王听到犬戎进攻的消息，惊慌失措，急忙命令烽火台点燃烽火。烽火倒是点起来了，可惜诸侯们因前几次受了愚弄，这次都不再理会。在内乱外患的双重打击下，醉生梦死的周幽王带领褒姒、伯服等人携王室珍宝逃往骊山，最终落得个身首异处、命丧黄泉的悲惨下场。`
        },
      ]
  },
  {
    year: -770,
    country:
      [
        { id: 4, incident: '原太子宜臼在申侯的拥戴下即天子位，延续周祀，是为周平王。周平王在秦襄公、晋文侯、郑武公、卫武公的带兵护送下东迁洛邑时，周幽王的弟弟余臣在虢公的支持下也称王，即周携王' },
      ]
  },
  {
    year: -527,
    country:
      [
        { id: 8, incident: '楚平王在费无极的谗言下娶了自己的儿媳妇',info:`当初楚平王在蔡国的时候，蔡国有个边境官员的女儿私奔到他那里，生下了太子建。平王即位后，便派伍奢当太子建的首席老师，即太子太傅。而费无极则位居副职，做了太子少傅。

        当“老二”需要一份胸怀，当老师更需要一份胸怀，身为“老二级别”的费无极老师偏偏严重缺乏胸怀。由于太子建尊重伍奢而嫌恶费无极，得不到学生信任的费老师不仅不深刻检讨反思自身存在问题，反而在自己学生和同事身上打起了鬼主意。
        
        费无极得不到宠信，便想要诬陷太子。他向楚平王建议：“太子建可以娶妻了。”男大当婚，这是天经地义之事。公元前527年，“好爸爸”楚平王为时年十五岁的儿子太子建娶亲，选中了秦国秦景公之女孟嬴，遂昭告天下一切备绪，并派遣大臣费无极专程前往秦国迎娶。费无极见秦国嫁给太子建的女子长得非常姣美，再加上自己对太子建非常忌恨，就动了邪念，认为这么漂亮的姑娘不应该为太子建拥有。
        
        费无极当然无法染指美丽的孟嬴，但深谙“美女经济”之道的小政客，于是从孟嬴身上看到了可以兑换的政治利益。
        
        既然太子建不该得到美女，那这个美女谁才配真正拥有呢？那当然只有楚平王了。
        
        于是，费无极不顾一切快马回宫对楚平王细述姑娘之美，那可是倾国倾城、绝世无双；并向楚平王真诚建议：“机会难得，美女难求呀，君王您完全可以自己娶之为妻子，给太子另外找一位女子做妻子。”男人对于美色的诱惑往往难以抗拒，尤其是被费无极独家广告渲染下的美女。楚平王被巧舌如簧的费无极说动了心，本该属于制片人角色的他雄心勃勃地当起了主演。转眼间，这位本该成为太子夫人的秦国姑娘，便成了公爹楚平王的妃子。
        
        费无极用“调包计”办妥此事，更深得楚平王的赏识了。然而，做贼心虚的费无极却寝食不安忧心忡忡，他知道太子迟早也会成为君王的，于是又萌生了“调人”之计。费无极对楚平王说：“晋国之所以能够称霸，是因为近中原；而楚国偏狭小，所以不能同晋国争雄。如果扩大城父的城墙，把太子安排在那里，以便和北方各诸侯国交往，就可以取得天下。”正为父子之间低头不见抬头见的尴尬而伤透脑筋的楚平王很高兴，再一次听从了费无极的建议。
        ` },

      ]
  },
  {
    year: -523,
    country:
      [
        { id: 8, incident: '楚平王让太子熊建离开国都，去镇守城父',info:'作为太子太傅，伍奢父子也陪同情场官场双失意的太子到了楚国北疆的城堡驻守。' },
      ]
  },
  {
    year: -522,
    country:
      [
        { id: 8, incident: '太子建得以奔宋国而逃亡',info:`到城父后的第二年（公元前522年），小人得志利令智昏的费无极，干脆一不做二不休，再次施行“调命”之计，向楚平王诬告太子建“外交诸侯，将入为乱”。费无极的目的，是通过诬陷太子建谋反，达到斩草除根的效果，彻底清除后顾之忧；同时通过改立孟嬴的儿子轸当太子，换取自己的官禄晋升。“子不教，师之过”。信以为真的楚平王，立刻召见太子建的老师伍奢，严加诘问。三代以刚直谏诤著称的伍氏家族，这个时候当然不会出卖自己的原则。伍奢借此规劝平王：“大王受到佞臣蒙蔽，已经夺去了儿媳，又要谋杀儿子，于心何忍？”打人莫打脸，揭人莫揭短，伍奢的话使楚平王丧失了最后一点理智。他下令立即把伍奢囚禁，并派城父司马奋扬去杀死太子建。奋扬情知太子建无辜，便暗中派人先去向太子建告密，才使太子建得以奔宋国而逃亡。

        费无极深知伍奢两个儿子伍尚、伍子胥相当了得，不杀他们，恐日后为患。在费无极的唆使下，楚平王一面派人去追杀太子建，一面又逼伍奢写信给他的两个儿子，以营救父亲的高尚名义诱骗他们回来，以便一起除掉。
        
        楚平王派人去召伍子胥兄弟二人回来，说：“只要回来，我就赦免你们的父亲。”棠邑大夫伍尚看到信就要动身，伍子胥警告他：“这是阴谋，楚王忌惮我们的威名，不敢伤害父亲。他们把父亲扣作人质，就是要把我们一网打尽。你先不要去，我来设法救出父亲。”伍尚对弟弟伍子胥说：“你到吴国去，我准备回去送死。我的才智比不上你，我能为父亲而死，你能为父亲报仇。听到可以赦免父亲的命令，不能不赶快回去；亲人被杀戮，不能没有人报仇。赴死而使父亲得到赦免，这是孝顺；掂量成功的可能性而行动，这是仁义；选择重任而前往，这是明智；明知必死而不躲避，这是勇气。父亲不可以抛弃，名誉不可以毁掉，你努力而为吧！这样总比两个人跟在一起好。”子胥说：“既然如此，我们兄弟只好就此别过。”
        
        伍子胥头脑清醒，看问题尖锐，在父亲与兄长的生死关头，毅然选择了逃走。这并不是懦弱，而是他深知：在这场政治阴谋中，应父之召必然父子俱死；而不回，或许平王还有顾忌；即使再不济，也还有报仇雪恨的机会。退一步海阔天空，忍辱逃走，不是为了苟且偷生，而是怕“俱灭，无为也”。所以伍子胥不得不弃小义而雪大耻，走上了一条“奔他国，借力以雪父之耻”的复仇之路。` },
      ]
  },
  {
    year: -514,
    country:
      [
        { id: 14, incident: '吴王阖闾即位' },

      ]
  },
  {
    year: -512,
    country:
      [
        { id: 14, incident: '吴军连年扰楚，迫楚军被动应战',info:'此后数年间，吴军连年扰楚，迫楚军被动应战，疲于奔命，实力大为削弱。吴随即展开大举攻楚的准备，争取与楚有矛盾的蔡、唐两国作为自己的盟国，使楚北方门户洞开，为而后避开楚军防守正面实施突袭创造了条件；又出兵攻越，给楚造成吴不会大举攻楚的假象，并施反间于楚，使楚不用知兵善战的子期，而用贪鄙无能的子常为帅。' },
      ]
  },
  {
    year: -510,
    country:
      [
        { id: 14, incident: '越国允常执政，吴国阖闾大举侵犯越国', info: '原因是：吴王指责越王允常身为盟友“不听话”，没有跟自己一块参与打楚国' },

      ]
  },
  {
    year: -506,
    country:
      [
        { id: 14, incident: '吴王阖闾伐楚', info: '吴王阖闾应子胥、伯嚭复仇伐楚的请求，重用孙武为大将，子胥、伯嚭为副将，大举攻楚。伍子胥与孙武等佐阖闾统领大军沿淮水西进，由楚防备薄弱的东北部实施大纵深战略突袭，直捣楚腹地，以灵活机动的战法，击败楚军主力于柏举。接着展开追击，五战五捷，长驱攻入楚国都城郢都，终成破楚之功。' },

      ]
  },
  {
    year: -505,
    country:
      [
        { id: 15, incident: '越王允常决定举兵反击', info: '允常趁当时吴军正在与楚交战期间，挥师偷袭，兴兵伐吴，对五年前吴军进犯展开了军事报复。然而，由于吴国军事力量正处于鼎盛时期，越军并未取得重大战果' },
      ]
  },
  {
    year: -503,
    country:
      [
        { id: 14, incident: '兵圣孙武从吴国退隐山林 ' },
      ]
  },
  {
    year: -497,
    country:
      [
        { id: 15, incident: '越王允常去世，勾践继位 ' },
      ]
  },
  {
    year: -496,
    country:
      [
        {
          id: 14, incident: '吴国阖闾亲自率领吴国大军攻越，吴王阖闾阵亡，吴王夫差继位 ', info: `勾践让人把越国大牢中的死囚犯组织集中起来，以临时组建一支敢死队，勾践现场展开了一场堪称深刻的思想动员。\n当吴、越双方在檇李摆开战场后，勾践先派出两支队伍发起攻势。然而，吴军阵势严整，不动如山，导致越国的这两次猛攻都劳而无功，反而损失惨重。\n正当阖闾和吴国众将看着先前不堪一击四处逃散的越军哈哈大笑，放松警惕的时候，突然见到越国军阵中走出了三排赤身露体、披发赤足的人来。每排皆有百余人，每个人一手拎着自己的散发，一手以剑按颈，嘴里高喊着口号，步履整齐地向吴军阵营大踏步走过来。只听得越军前排有人高喊：“吴、越两国君王在此兵戎相见，我等在行动中动作不敏，触犯军令，不敢逃避刑罚，羞于苟活，愿意在阵前自杀谢罪。”话一说完，脖子一抹，鲜血四溅，齐刷刷的，倒地而亡。\n吴军上下傻眼了，这是演的哪出戏呀？怎么两军交战，还没拼出个你死我活，倒自己把自己给抹了脖子？前面的军士看傻了，还没回过神来，而后面的将士听说出怪事了，也顾不上这是在打仗了，纷纷争着挤着要凑上前去看热闹，挡都挡不住。这身形一移动，吴军先前严密齐整的队形开始乱了。
先前的惨烈血腥还没有让吴国军士们反应过来，第二队不要命的人又大踏步上来了。依然是那几句话，一喊完，一抹脖子，刎颈而死。随后，第三排也同样大踏步上来，依样画葫芦，又抹了自己的脖子。在吴国军士的眼里，如果越国第一队敢死队的行为让他们惊呆和不解的话，第二队和第三队的相继上阵已让他们心生恐惧了。\n这是怎样的一支队伍呀，见过不要命的，没见过如此不要命的，还给不给我们战斗的机会了？这还算是正常的人吗？近距离注目观看的吴军将士，顿时惊骇不已，军心大乱，所有人的大脑在那一个时刻被深深震撼，短时间内根本反应不过来。勾践不失时机，突然指挥进攻，一举大败吴军，使溃不成军的吴军死伤无数。\n在战争中，越大夫灵姑浮“以戈击阖闾，阖闾伤将指”，不但斩落他的脚趾，还捡到了他的一只鞋。身受重伤的阖闾血流如注，也许是受了破伤风感染，也许是始终过不去心头那道坎，一生征战无数却在退到七里后的陉地时，终于阵亡于军中。`},
      ]
  },
  {
    year: -494,
    country:
      [
        { id: 15, incident: '勾践主动进攻吴国，战败，被围困会稽山',info:`在这场战争中，越军的最高统帅勾践属于年少冲动的愣头青，客侵他国，失德无道；最高军事指挥长官石买则属于专权好利的贪婪客，多怨无谋。而他们面对的对手呢？则是心怀家仇国恨憋屈了三年，用卧薪苦志不断激励的方式强迫自己变得强大的夫差，以及善于运筹帷幄并具有丰富军事作战指挥经验的伍子胥。

        战斗正式打响了。吴军耻丧先王，誓死图报，夫差更是亲立船头，秉袍击鼓，全军勇气倍增。恰好北风大起，波涛汹涌，吴军大舰顺流扬帆而下，俱用强弓劲弩，箭如飞蝗。越兵迎风，无法抵敌，大败而走。伍子胥已看出越军的败象，知其必败，便屡出奇谋，指北攻南，指南攻北，声东击西，常于深夜举火击鼓，虚张声势，并不出兵，又于白日布下伪装的部队，造成假象，迷惑越军。
        
        在这样一系列虚虚实实的折腾下，由于越军指挥无方，将士们身心疲惫，草木皆兵，最终造成了军心涣散，斗志全无；同时，大将军石买却偏偏又坚持“峻法隆刑”来“斩杀无罪”。在敌我的双重压力下，越军士众恐惧，兵将们相继倒戈逃散，石买的军令已无人执行。迫不得已，勾践只好下令斩杀石买以向全军谢罪。
        
        然而，战局胜负已分，不可逆转了。在强大的吴国精兵面前，指挥无方、训练不佳、装备不精、战力不强、士气无存的越军哪里还有还手之力，根本无力对抗吴军的虎狼之势，以至于屡战屡败、节节败退。而吴军当然没有放弃追击。在取得太湖水战胜利后，夫差和伍子胥指挥着吴国精兵，乘胜越过钱塘江，长驱直入越国都城。
        
        勾践心想，还是保命要紧吧。于是，他索性连都城也放弃了，携带着越国群臣一股脑退守在越国境内的会稽山上。会稽山，古称茅山、苗山，既是大禹会聚诸侯之地，也是大禹的葬身之地，更是越国的镇山和神山。勾践寄希望于越国神山的保护，祖宗的恩佑，恃险据守，获得一线生机。
        
        战争带来的伤害是巨大的。安顿下来的勾践顺便清点了一下人数：惨哪！只剩下五千残兵了。这可咋办？他站起身来立于会稽之巅，登山远望，只见战火蔓延，四处破烂不堪，田地荒芜，一片萧然。“念天地之悠悠，独怆然而涕下”。而“萧山”这个词，在此情此景下，也从勾践的口中迸出。退守在会稽山上的勾践真的安全了吗？` },
      ]
  },
  {
    year: -493,
    country:
      [
        { id: 15, incident: '越王勾践战败入吴为奴三年 ',info:'每年为吴进贡，解散越国内部武装力量' },
      ]
  },
  {
    year: -490,
    country:
      [
        { id: 15, incident: '越王勾践回国，卧薪尝胆' ,info:'第一个步骤是“改作风，修自身”;第二个步骤是“勤学习，敬师友”;第三个步骤是“任贤良，举人才”;第四个步骤是“育人口，扩兵源”;第五个步骤是“兴农业，保民生”;第六个步骤是“促经济、强工业”;第七个步骤是“迁都城、补缺陷”'},
      ]
  },
  {
    year: -482,
    country:
      [
        { id: 15, incident: '鲁国的鲁哀公、晋国的晋定公约会夫差，举行会盟大典,被越国偷塔了',info:`看到颇有影响力的老牌诸侯邀请自己会盟，夫差兴奋得几天几夜难以入睡。为了跨越式提升吴国的地位，夫差不顾太子友“螳螂捕蝉，黄雀在后”的善意忠告，而固执己见地调集全国可用之精兵，甲胄鲜明地朝黄池浩浩荡荡地出发了。

        就在夫差志得意满地与鲁哀公、晋定公并排站在封禅台上，检阅三军，光彩夺目之时，就在鲁哀公、晋定公赞扬吴王“上马可治军，下马可治国”，夫差正沉浸在他一生中辉煌美好的幸福时刻，一个不幸的消息也随之而来。越国在掌握吴军精锐部队尽出的情报后，由范蠡、洩庸二人秘密在吴越边境集结了三万精兵，一举打通长江沿线，以迅雷不及掩耳之势一举攻进吴国国都，打败了太子友，焚烧了姑苏台，还顺手拖走了吴国的大船。` },
      ]
  },
  {
    year:-475,
    country:
      [
        { id: 15, incident: '越王开赴前线准备攻吴 ',info:'围吴军困姑苏城三年' },
      ]
  },
  {
    year:-473,
    country:
      [
        { id: 15, incident: '姑苏城终于失守，越军进城 ,夫差自刎于姑苏山',info:'吴国都城经过越军长达三年的围攻封锁后，军民疲困，举国绝望，士卒离散，无力战斗。最后，坚固的姑苏城终于失守，越军进城。吴王夫差见大势已去，与王孙骆、伯嚭及卫队趁着夜色突围偷偷跑了。被重重围困在姑苏山上的夫差，眼见大势已去，只得派出王孙骆向越国求和，请求愿为附庸，世世代代事越。来使的言辞切切，让越王有些心动了。然而在面对这个重大问题决策的关键时刻，范蠡一扫往昔的柔弱卑下之风，以强硬的姿态予以了拒绝，并且警告勾践：“天与不取，反受其咎。范蠡与西施退政从商，成为商道始祖”' },
      ]
  }
]
let wrap = document.querySelector('tbody');
let str = '';
for (let i = 0; i < arr.length; i++) {
  str += `<tr><th class="thFiexd" scope="row">${arr[i].year < 1 ? '前' + Math.abs(arr[i].year) : arr[i].year}</th>`
  for (let j = 0; j < arr[i].country.length; j++) {
    if (j > 0) {
      let num = arr[i].country[j].id - arr[i].country[j - 1].id;
      for (let n = 1; n < num; n++) {
        str += `<td></td>`
      }
    } else {
      for (let n = 1; n < arr[i].country[j].id; n++) {
        str += `<td></td>`
      }
    }
    str += `<td>${arr[i].country[j].incident}`
    if (arr[i].country[j].info) {
      str += `<div><i>详情</i><div>${arr[i].country[j].info}<div></div>`
    }
    str += `</td>`
  }
  str += `</tr>`
}
wrap.innerHTML = str;



let table = document.getElementById("table-cont");
let idDown = false;
let [dx, dl, mx, ml, Btop, Bleft] = [0, 0, 0, 0, 0, 0]
table.onmousedown = function (e) {
  dx = e.clientX
  dl = e.clientY
  idDown = true;
  Btop = document.getElementById("table-cont").scrollTop;
  Bleft = document.getElementById("table-cont").scrollLeft;
}
window.onmousemove = function (e) {
  if(e.clientX<60||e.clientY<115||e.clientX>winW||e.clientY>winH){
    idDown = false;
  }
  if (!idDown) {
    return;
  }
  mx = e.clientX - dx;
  ml = e.clientY - dl;
  document.getElementById("table-cont").scrollLeft = (mx - Bleft) * -1
  document.getElementById("table-cont").scrollTop = (ml - Btop) * -1
}
table.onmouseup = function (e) {
  idDown = false;
}
